#### BuiltInFailures.CopyMonitorFailures Members

---

|  |
| --- |
| BuiltInFailures CopyMonitorFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures CopyMonitorFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AlreadyCopiedAndStopWatch | Element has already been copied. Stop existing monitoring to copy again. |
| Public property Static member | AlreadyWatched | Elements already monitored. |
| Public property Static member | CannotCopyCuttingInsert | Copy/Monitor does not support cutting inserts in floors. Some openings were not copied. |
| Public property Static member | CannotMoveHostedFixtureViaCopyMonitor | The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required. |
| Public property Static member | CopyWatchAlert | Coordination Monitor alert : [Description] |
| Public property Static member | GridDeletedSameName | Grid cannot be copied because grid with desired name '[Name]' already exist in a target document. |
| Public property Static member | LevelDeletedSameName | Level cannot be copied because level with desired name '[Name]' already exist in a target document. |

# See Also

BuiltInFailures CopyMonitorFailures Class

Autodesk.Revit.DB Namespace